"""
Дан список строк.
Создать новый список с длинами этих строк

Пример:
['two', 'words'] -> [3, 5]
"""

list_1 = ['Мама', 'мыла', 'рыбууу', 'неизвестно', 'зачем']

list_len = []

for i in list_1:
    list_len.append(len(i))

print(list_len)
